# -------------------------
# Homebrew taps
# -------------------------
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# -------------------------
# CLI tools (formulae)
# -------------------------
brew "git"
brew "git-lfs"
brew "gh"
brew "wget"
brew "curl"
brew "btop"
brew "htop"
brew "tree"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "neovim"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "tldr"
brew "starship"
brew "powerlevel10k"
brew "watch"
brew "sketchybar"
brew "skhd"
brew "ncdu"
brew "bat"
brew "eza"
brew "lsd"
brew "entr"
brew "openssl"
brew "python"
brew "node"
brew "pnpm"
brew "yarn"
brew "go"
brew "rust"
brew "ruby"
brew "zig"
brew "docker"
brew "docker-compose"
brew "terraform"
brew "nmap"
brew "tailscale"
brew "mas"
brew "neofetch"
brew "fastfetch"
brew "ffmpeg"
brew "yt-dlp"
brew "stow"
brew "zoxide"
brew "lazygit"
brew "lazydocker"
brew "yazi"
brew "fzf"
brew "jq"
brew "thefuck"
brew "tmux"
brew "nginx"
brew "mongodb-community"
brew "mysql"
brew "cloc"
# -------------------------
# GUI Applications (casks)
# -------------------------
cask "google-chrome"
cask "firefox"
cask "arc"
cask "brave-browser"

cask "iterm2"
cask "ghostty"

cask "visual-studio-code"
cask "cursor"
cask "zed"

cask "docker"
cask "orbstack"
cask "postman"

cask "raycast"
cask "hammerspoon"
# cask "yabai"
# cask "karabiner-elements"
# cask "aerospace"
cask "linearmouse"

cask "obsidian"
cask "notion"
cask "figma"
cask "canva"

cask "discord"
cask "slack"
cask "zoom"

cask "vlc"
cask "dbeaver-community"
cask "ngrok"

# -------------------------
# Fonts
# -------------------------
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"

# -------------------------
# Mac App Store apps
# -------------------------
mas "Xcode", id: 497799835
